# Triton Inference Server Configuration for Allam TensorRT-LLM Model
# Requirements: 1.1, 2.4
#
# This configuration sets up the Allam Arabic LLM with TensorRT-LLM backend
# for high-performance inference on NVIDIA GPUs.

name: "allam_tensorrt"
backend: "tensorrtllm"
max_batch_size: 8

# Model versioning
model_transaction_policy {
  decoupled: True
}

# Input tensors for TensorRT-LLM
input [
  {
    name: "input_ids"
    data_type: TYPE_INT32
    dims: [-1]
    allow_ragged_batch: true
  },
  {
    name: "input_lengths"
    data_type: TYPE_INT32
    dims: [1]
    reshape: { shape: [] }
  },
  {
    name: "request_output_len"
    data_type: TYPE_INT32
    dims: [1]
    reshape: { shape: [] }
  },
  {
    name: "end_id"
    data_type: TYPE_INT32
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "pad_id"
    data_type: TYPE_INT32
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "beam_width"
    data_type: TYPE_INT32
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "temperature"
    data_type: TYPE_FP32
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "top_k"
    data_type: TYPE_INT32
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "top_p"
    data_type: TYPE_FP32
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "repetition_penalty"
    data_type: TYPE_FP32
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "streaming"
    data_type: TYPE_BOOL
    dims: [1]
    reshape: { shape: [] }
    optional: true
  },
  {
    name: "stop_words_list"
    data_type: TYPE_INT32
    dims: [2, -1]
    optional: true
    allow_ragged_batch: true
  }
]

# Output tensors
output [
  {
    name: "output_ids"
    data_type: TYPE_INT32
    dims: [-1, -1]
  },
  {
    name: "sequence_length"
    data_type: TYPE_INT32
    dims: [-1]
  },
  {
    name: "cum_log_probs"
    data_type: TYPE_FP32
    dims: [-1]
  },
  {
    name: "output_log_probs"
    data_type: TYPE_FP32
    dims: [-1, -1]
  }
]

# GPU instance configuration
# Allocate model to GPU 0 with single instance
instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [0]
  }
]

# TensorRT-LLM specific parameters
parameters {
  key: "gpt_model_type"
  value: { string_value: "llama" }
}

parameters {
  key: "gpt_model_path"
  value: { string_value: "/models/allam_engine" }
}

parameters {
  key: "max_tokens_in_paged_kv_cache"
  value: { string_value: "2560" }
}

parameters {
  key: "batch_scheduler_policy"
  value: { string_value: "max_utilization" }
}

parameters {
  key: "kv_cache_free_gpu_mem_fraction"
  value: { string_value: "0.8" }
}

parameters {
  key: "enable_chunked_context"
  value: { string_value: "true" }
}

parameters {
  key: "decoding_mode"
  value: { string_value: "top_k_top_p" }
}

# Dynamic batching configuration for optimal throughput
dynamic_batching {
  preferred_batch_size: [1, 2, 4, 8]
  max_queue_delay_microseconds: 100000
}

# Response cache for repeated queries
response_cache {
  enable: true
}
